# Pandas

In [117]:
import pandas as pd

In [118]:
list1 = [1,2,3,4]

In [3]:
a = pd.Series(list1)

In [4]:
a

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
type(a)

pandas.core.series.Series

In [6]:
a[2]

3

In [7]:
a[1]

2

In [8]:
#labels in Series
label1 = ['a','b','c','d']

In [9]:
b = pd.Series(data=list1,index=label1)

In [10]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [11]:
b['b']

2

In [12]:
b[1]

2

In [13]:
 #we can call using labels or with regular index

In [14]:
#addition of 2 series
ser1 = pd.Series(['usa','ind','anz'])

In [15]:
ser2 = pd.Series(['pak','eng','aus'])

In [16]:
ser3 = ser1 + ser2

In [17]:
ser3

0    usapak
1    indeng
2    anzaus
dtype: object

In [18]:
#In real time we do not use series as it contains only 1 dimension
#We use to represent the data in multidimension

In [19]:
#----------Dataframe------------
list1 = [1,2,3,4]
df1 = pd.DataFrame(list1)
df1

   0
0  1
1  2
2  3
3  4

In [20]:
#4x4 dataframe
list2 = [[1,2,3,4],[5,6,7,8],[2,4,5,6],[9,6,2,1]]
df2 = pd.DataFrame(list2)
df2

   0  1  2  3
0  1  2  3  4
1  5  6  7  8
2  2  4  5  6
3  9  6  2  1

In [21]:
#dataframe with some specific labels
df3 = pd.DataFrame(list2, columns = ['a','b','c','d'],index = ['A','B','C','D'])

In [22]:
df3

   a  b  c  d
A  1  2  3  4
B  5  6  7  8
C  2  4  5  6
D  9  6  2  1

In [23]:
#creationn of dataframe using numpy arrays
import numpy as np
a = np.arange(16).reshape(4,4)
a

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [24]:
df4 = pd.DataFrame(a,columns='a b c d'.split(),index='A B C D'.split())

In [25]:
df4

    a   b   c   d
A   0   1   2   3
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

In [26]:
#dont get confusion
#if you split a string it will convert into list only
'a b c d'.split()
#in above we wrote like this only

['a', 'b', 'c', 'd']

In [27]:
#task---question
#create a dataframe as randomint function as size 5x5
#give columnn name as subject marks
#give row names as student names

In [28]:
#task---answer
b = np.random.randint(100,size = (5,5))
df5 = pd.DataFrame(b,columns=['Tel','Hin','Eng','Mat','Sci'], index = 'raju ravi rani ramu remo'.split())
df5

      Tel  Hin  Eng  Mat  Sci
raju   36   30   86   36   31
ravi   57   64   78   94   74
rani   83   66    0   48   25
ramu   88    8   61   16   46
remo    4   34   31   29   87

In [29]:
#--------------indexing of dataframe--------------#
#To display a selective column
df5['Tel']

raju    36
ravi    57
rani    83
ramu    88
remo     4
Name: Tel, dtype: int64

In [30]:
#To display a selective row
#df5['raju'] - It gives keyerror
#It is telling raju is not found in the column
#So here we use a function called 'loc' ie location
#loc - we use to fetch a specific row

df5.loc['raju']

Tel    36
Hin    30
Eng    86
Mat    36
Sci    31
Name: raju, dtype: int64

In [31]:
#fetching row using index location
#iloc - we use to fetch a specific row using with its index number
df5.iloc[0]

Tel    36
Hin    30
Eng    86
Mat    36
Sci    31
Name: raju, dtype: int64

In [32]:
df5.loc['rani']

Tel    83
Hin    66
Eng     0
Mat    48
Sci    25
Name: rani, dtype: int64

In [33]:
df5.iloc[2]

Tel    83
Hin    66
Eng     0
Mat    48
Sci    25
Name: rani, dtype: int64

In [34]:
#How to fetch the bottom few selected rows and column values
df5.iloc[2:,1:]

      Hin  Eng  Mat  Sci
rani   66    0   48   25
ramu    8   61   16   46
remo   34   31   29   87

In [35]:
df5.iloc[2:,3:]

      Mat  Sci
rani   48   25
ramu   16   46
remo   29   87

In [36]:
#------------pandas functions--------------#n
dataset = pd.DataFrame(np.random.randint(10,20,16).reshape(4,4),'a b c d'.split(),'e f g h'.split())

In [37]:
dataset

    e   f   g   h
a  16  15  19  16
b  16  19  18  18
c  17  18  14  10
d  14  11  13  15

In [38]:
#1
#head() - It gives top 5 rows in Python dataframe
dataset.head()

    e   f   g   h
a  16  15  19  16
b  16  19  18  18
c  17  18  14  10
d  14  11  13  15

In [39]:
dataset.head(2)

    e   f   g   h
a  16  15  19  16
b  16  19  18  18

In [40]:
#2
#tail() - It gives bottom 5 rows in Python dataframe
dataset.tail()

    e   f   g   h
a  16  15  19  16
b  16  19  18  18
c  17  18  14  10
d  14  11  13  15

In [41]:
dataset.tail(2)

    e   f   g   h
c  17  18  14  10
d  14  11  13  15

In [42]:
#3
#info()- gives overall information of dataframe
dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   e       4 non-null      int64
 1   f       4 non-null      int64
 2   g       4 non-null      int64
 3   h       4 non-null      int64
dtypes: int64(4)
memory usage: 160.0+ bytes

In [43]:
#4
#describe() - It gives all statistical information of dataset
dataset.describe()

               e          f         g         h
count   4.000000   4.000000   4.00000   4.00000
mean   15.750000  15.750000  16.00000  14.75000
std     1.258306   3.593976   2.94392   3.40343
min    14.000000  11.000000  13.00000  10.00000
25%    15.500000  14.000000  13.75000  13.75000
50%    16.000000  16.500000  16.00000  15.50000
75%    16.250000  18.250000  18.25000  16.50000
max    17.000000  19.000000  19.00000  18.00000

In [44]:
#5
#reset_index() - It makes index as column and puts default index
dataset.reset_index()

  index   e   f   g   h
0     a  16  15  19  16
1     b  16  19  18  18
2     c  17  18  14  10
3     d  14  11  13  15

In [46]:
dataset.set_index('h')

     e   f   g
h
16  16  15  19
18  16  19  18
10  17  18  14
15  14  11  13

In [48]:
#here actual 'index' column gets deleted annd 'h' column becomes index

In [49]:
#new column adding and deleting

In [50]:
dataset['newcolumn'] = ['45','46','47','48']

In [51]:
dataset

    e   f   g   h newcolumn
a  16  15  19  16        45
b  16  19  18  18        46
c  17  18  14  10        47
d  14  11  13  15        48

In [55]:
#will show error below code because we didnt specify axis
#dataset.drop('newcolumn')

In [56]:
dataset.drop('newcolumn',axis=1)

    e   f   g   h
a  16  15  19  16
b  16  19  18  18
c  17  18  14  10
d  14  11  13  15

In [57]:
#newcolumn is deleted but lets check whether column is really deleted or not

In [58]:
dataset

    e   f   g   h newcolumn
a  16  15  19  16        45
b  16  19  18  18        46
c  17  18  14  10        47
d  14  11  13  15        48

In [59]:
#oh no!
#therefore above deletion is temporary deletion
#to delete the column permanently we need to add 1 more argument "inplace =true"

In [61]:
dataset.drop('newcolumn',axis=1,inplace = True)

In [63]:
#now lets check whether column deleted or not
dataset

    e   f   g   h
a  16  15  19  16
b  16  19  18  18
c  17  18  14  10
d  14  11  13  15

In [64]:
#yahoo, now column got deleted permanently

In [65]:
#or another way is assign dataset variable to it
#dataset = dataset.drop('newcolumn',axis=1)

In [67]:
#---unique()---
dataset['e'].unique()

array([16, 17, 14])

In [68]:
#value_counts()
dataset['e'].value_counts()

16    2
14    1
17    1
Name: e, dtype: int64

In [72]:
#
dataset2 = pd.DataFrame([['usa','peru','chile','brazil'],["usa","amazon","ind","britan"],
                         ["japan","usa","china","britan"]])

In [73]:
dataset2

       0       1      2       3
0    usa    peru  chile  brazil
1    usa  amazon    ind  britan
2  japan     usa  china  britan

In [74]:
#lets see unique values in dataset2
#0th column
dataset2[0].unique()

array(['usa', 'japan'], dtype=object)

In [75]:
#0th row
dataset2.loc[0].unique()

array(['usa', 'peru', 'chile', 'brazil'], dtype=object)

In [77]:
#lets see value_counts in dataset2
#0th column
dataset2[0].value_counts()

usa      2
japan    1
Name: 0, dtype: int64

In [79]:
#0th row
dataset2.loc[0].value_counts()

brazil    1
usa       1
chile     1
peru      1
Name: 0, dtype: int64

In [83]:
#-----------working with missing values---------------#
#this is very important in data analysis
#lets first create a dataset
df = pd.DataFrame(np.random.rand(5,4),index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [84]:
df

          W         X         Y         Z
A  0.634041  0.633575  0.424086  0.778287
B  0.980044  0.649281  0.844927  0.633727
C  0.381007  0.186130  0.966439  0.689155
D  0.511735  0.847100  0.165701  0.279725
E  0.403813  0.137545  0.020392  0.170333

In [85]:
df>0.4

       W      X      Y      Z
A   True   True   True   True
B   True   True   True   True
C  False  False   True   True
D   True   True  False  False
E   True  False  False  False

In [86]:
#where ever values are less than 0.4 it will show false

In [89]:
#lets create a dataframe 
df2 = df[df>0.4]

In [90]:
df2

          W         X         Y         Z
A  0.634041  0.633575  0.424086  0.778287
B  0.980044  0.649281  0.844927  0.633727
C       NaN       NaN  0.966439  0.689155
D  0.511735  0.847100       NaN       NaN
E  0.403813       NaN       NaN       NaN

In [91]:
#In the place where ever values are lesser than 0.4 will replaced with NaN values
# these are called missing values or null values

In [93]:
#How to check whether there are any null values
df2.isnull().any

<bound method DataFrame.any of        W      X      Y      Z
A  False  False  False  False
B  False  False  False  False
C   True   True  False  False
D  False  False   True   True
E  False   True   True   True>

In [94]:
#whereever it is showing True those are all null values only

In [95]:
#this is small dataset easily we could able to identify
#what if there is a dataset with 1 lakh rows and 12 columns?
#it is very tough to find right?
#so for that we have another function
df2.isnull().any()

W    True
X    True
Y    True
Z    True
dtype: bool

In [96]:
#just that () we need to add to above type....
# it gives each column name and tells True even if 1 null value is there

In [97]:
#it is just showing null values are there
#but how will we get to know how many null values it has
# using below code
df2.isnull().sum()

W    1
X    2
Y    2
Z    2
dtype: int64

In [98]:
#let us say if we have a dataset of 120000 rows and 5 columns
#a = 10000 null vales
#b = 35 null values
#c = 0 null values
#d = 42 null values
#e = 13 null values
#In this situation w delete a column using drop()

In [99]:
#row wise deletion happens even if it see's 1 null value in row
df2.dropna() #will not get effect to original df2

          W         X         Y         Z
A  0.634041  0.633575  0.424086  0.778287
B  0.980044  0.649281  0.844927  0.633727

In [102]:
#column wise deletion happens even if it see's 1 null value in column
df2.dropna(axis = 1)    #will not get effect to original df2

Empty DataFrame
Columns: []
Index: [A, B, C, D, E]

In [104]:
df2.dropna(thresh = 2)

# any row if it contains more than 3 null values then only it will delete the row
# minimum 2 null values are acceptable

          W         X         Y         Z
A  0.634041  0.633575  0.424086  0.778287
B  0.980044  0.649281  0.844927  0.633727
C       NaN       NaN  0.966439  0.689155
D  0.511735  0.847100       NaN       NaN

In [107]:
df2.dropna(thresh = 2, axis = 1)

#if any column if it contains more than 3 null values then only it will delete that column
#minimum 2 null values are acceptable in that column
#thats why it printed all columns

          W         X         Y         Z
A  0.634041  0.633575  0.424086  0.778287
B  0.980044  0.649281  0.844927  0.633727
C       NaN       NaN  0.966439  0.689155
D  0.511735  0.847100       NaN       NaN
E  0.403813       NaN       NaN       NaN

In [108]:
#strategy 1
#dropping missing values is one strategy of handling missing values

In [109]:
#stragey 2
#now lets try to understand another strategy of handling missing values but fill them with some values

In [110]:
df2.fillna(value = 'nothing')

          W         X         Y         Z
A  0.634041  0.633575  0.424086  0.778287
B  0.980044  0.649281  0.844927  0.633727
C   nothing   nothing  0.966439  0.689155
D  0.511735    0.8471   nothing   nothing
E  0.403813   nothing   nothing   nothing

In [111]:
df2.fillna(value = 0)

          W         X         Y         Z
A  0.634041  0.633575  0.424086  0.778287
B  0.980044  0.649281  0.844927  0.633727
C  0.000000  0.000000  0.966439  0.689155
D  0.511735  0.847100  0.000000  0.000000
E  0.403813  0.000000  0.000000  0.000000

In [112]:
#strategy 3
#the other way of handling missing values is replacing the missing value with 
#mean, median and mode
df2.fillna(df['X'].mean())

          W         X         Y         Z
A  0.634041  0.633575  0.424086  0.778287
B  0.980044  0.649281  0.844927  0.633727
C  0.490726  0.490726  0.966439  0.689155
D  0.511735  0.847100  0.490726  0.490726
E  0.403813  0.490726  0.490726  0.490726

In [113]:
#median
df2.fillna(df['X'].median())

          W         X         Y         Z
A  0.634041  0.633575  0.424086  0.778287
B  0.980044  0.649281  0.844927  0.633727
C  0.633575  0.633575  0.966439  0.689155
D  0.511735  0.847100  0.633575  0.633575
E  0.403813  0.633575  0.633575  0.633575

In [114]:
#mode we use whenever we have string data

#when to use mean, median and mode
name age  sal   loc   bank_years     stay
x     32  15k   hyd    6              yes
y     56   6L   amrpt  30             yes

# In age if we have missing values we take mean as range of values are small
# In sal if we have missing values we take median as range of values are large
# In loc if we have missing values we take mode as maximum times displayed values will consider